{
  "device.busy": "指标定义：该指标用于综合反映服务器（裸金属、虚拟机、宿主机）的资源利用情况，由服务器的CPU和内存利用率（%)加权平均得到，值越高表示资源利用率越高。具体计算公式为：繁忙度=(CPU利用率+内存利用率)*100/2<br />运维建议：该指标的值为40-60的理想区间时，表示该服务器的资源利用率较为充分，且有足够的剩余资源来应对业务负载的正常波动，无需干预。若指标值低于40，则表示资源利用率偏低，需要考虑资源的缩容回收或调配承载更多业务。若指标值高于60，则表示承载业务系统的服务器负载过大，在负载波峰时有无法及时响应用户请求的风险，需要考虑扩容或将其承载的业务迁移到其他服务器上。",
  "device.unbalance": "指标定义：该指标用于综合反映服务器（裸金属、虚拟机、宿主机）的CPU和内存资源利用的均衡程度，由服务器的CPU和内存利用率（%)的差值得到，值越高表示资源利用越不均衡。具体计算公式为：资源利用不平衡度=(|CPU利用率-内存利用率|)*100<br />运维建议：该指标的值为0-30的理想区间时，表示该服务器的CPU和内存的资源使用比较均衡，无需干预。若指标值大于30，则表示该服务器承载的业务对CPU和内存的资源消耗比例与服务器的CPU和内存资源的配置比例不匹配，需要根据实际调整分配的服务器的资源规格，使得CPU与内存的配比与需求相一致，来提高整体的资源利用效率。",
  "device.health": "指标定义：该指标用于综合反映服务器的健康情况，由服务器当前存在的未恢复的故障告警和资源阈值告警根据告警级别加权相加作为满分100的减分项得到，得分越高表示业务系统越健康。具体计算公式为：健康度=100-MIN(100,(致命告警数量*100+严重告警数量*10+一般告警数量*1))<br />运维建议：该指标的值低于60分时，表示该服务器至少出现了一个致命故障或较多的严重故障，可能已影响到其承载的业务的可用性，需要根据关联的告警信息立即排查。若指标值处于60-90之间，表示该服务器存在严重故障或很多警告性的信息，可能会导致业务系统的响应速度变慢或存在无法继续提供服务的风险，需要重点关注及时处理。若指标值在90以上，表示该服务器运行良好，无需额外关注。",
  "device.ha": "指标定义：该指标反映服务器在一段时间内健康度不为0（健康度为0则认为该服务器不可用）的时间占总时长的百分比。由于指标的采样间隔是固定的，因此该指标的计算公式为：可用度=100-统计周期内健康度为0的指标数*100/统计周期内健康度指标数<br />运维建议：在正常运营的数据中心，各服务器的该指标的值一般应接近满分100。",
  "app.health": "指标定义：该指标用于综合反映承载业务系统的所有服务器的健康情况，由每台服务器当前存在的未恢复的故障告警和资源阈值告警根据告警级别加权相加作为满分100的减分项得到，得分越高表示业务系统越健康。具体计算公式为：健康度=100-MIN(100,SUM(致命告警数量*100+严重告警数量*10+一般告警数量*1)/服务器台数)<br />运维建议：该指标的值低于60分时，表示承载业务系统的服务器至少出现了一个致命故障或较多的严重故障，可能已影响到业务系统的可用性，需要根据关联的告警信息立即排查。若指标值处于60-90之间，表示承载业务系统的服务器存在严重故障或很多警告性的信息，可能会导致业务系统的响应速度变慢或存在无法继续提供服务的风险，需要重点关注及时处理。若指标值在90以上，表示承载业务系统的服务器运行良好，无需额外关注。",
  "app.busy": "指标定义：该指标用于综合反映承载业务系统的所有服务器（裸金属、虚拟机）的资源利用情况，由每台服务器的CPU和内存利用率（%)加权平均得到，值越高表示资源利用率越高。具体计算公式为：繁忙度=(SUM(各服务器CPU利用率)/服务器台数+SUM(各服务器内存利用率)/服务器台数)*100/2<br />运维建议：该指标的值为40-60的理想区间时，表示该业务系统的资源利用率较为充分，且有足够的剩余资源来应对业务负载的正常波动，无需干预。若指标值低于40，则表示资源利用率偏低，需要考虑资源的缩容回收。若指标值高于60，则表示承载业务系统的服务器负载过大，在负载波峰时有无法及时响应用户请求的风险，需要考虑扩容。",
  "app.unbalance": "指标定义：该指标用于综合反映承载业务系统的所有服务器（裸金属、虚拟机）的CPU和内存资源利用的均衡程度，由每台服务器的CPU和内存利用率（%)的差值加权平均得到，值越高表示资源利用越不均衡。具体计算公式为：资源利用不平衡度=SUM(|各服务器CPU利用率-各服务器内存利用率|)*100/服务器台数<br />运维建议：该指标的值为0-30的理想区间时，表示该业务系统对服务器的CPU和内存的资源使用比较均衡，无需干预。若指标值大于30，则表示业务系统对CPU和内存的资源消耗比例与服务器的CPU和内存资源的配置比例不匹配，需要根据实际调整分配的服务器的资源规格，使得CPU与内存的配比与需求相一致，来提高整体的资源利用效率。",
  "app.ha": "指标定义：该指标反映业务系统在一段时间内健康度不为0（健康度为0则认为业务系统不可用）的时间占总时长的百分比。由于指标的采样间隔是固定的，因此该指标的计算公式为：可用度=100-统计周期内健康度为0的指标数*100/统计周期内健康度指标数<br />运维建议：在正常运营的数据中心，各业务系统的该指标的值一般应接近满分100。",
  "app.assign": "指标定义：该指标反映业务系统的资源配额的实际使用率，也就是业务系统实际开通的裸金属服务器和虚拟机占所申请配额的比例。具体计算公式为：资源使用率评分=100*(业务系统实际使用的裸金属台数+业务系统实际使用的裸金属台数)/(业务系统的裸金属配额+业务系统的虚拟机配额)<br />运维建议：该指标值越高表示业务系统申请的资源配额已更大比例的用于实际承载业务系统的运行了。对于指标值偏低的业务系统应该了解资源使用偏低的原因，如果是需求评估不准确造成的过度冗余，可推动其提交资源回收，以提高资源的流动性。",
  "tenant.level": "指标定义：该指标为租户评分指标的另一种表现形式：租户评分指标值为0-60时，租户等级为C；租户评分指标值为60-80时，租户等级为B；租户评分指标值为80-100时，租户等级为A。",
  "tenant.score": "指标定义：该指标反映租户的资源管理、使用、缴费等方面的综合表现，设计计算公式为租户的资源管理评分、资源利用评分、信用评分这3个子指标进行加权求和得出。由于目前没有租户信用及工单处理方面的基础数据，无法得出租户的信用评分和资源管理评分。因此该指标与租户的资源利用评分相同。",
  "tenant.usageScore": "指标定义：该指标反映租户的对资源的分配和使用方面的表现，包括配额内实际分配使用的资源比例（资源使用率评分）和业务系统对资源利用的质量（CPU和内存资源利用综合评分和资源利用不平衡度评分）等子指标进行加权求和。具体计算公式为：资源利用评分=资源使用率评分*0.4+CPU利用评分*0.2+内存利用评分*0.2+(100-资源利用不平衡度评分)*0.2<br />运维建议：该指标的值越高，说明租户在资源需求估算、资源调配方面的能力越强。可以重点关注评分较低的租户，指导其更加合理的申请和调配资源。",
  "tenant.busy": "指标定义：该指标用于综合反映该租户使用的所有服务器（裸金属、虚拟机）的资源利用情况，由每台服务器的CPU和内存利用率（%)加权平均得到，值越高表示资源利用率越高。具体计算公式为：繁忙度=(SUM(各服务器CPU利用率)/服务器台数+SUM(各服务器内存利用率)/服务器台数)*100/2<br />运维建议：该指标的值为40-60的理想区间时，表示该业务系统的资源利用率较为充分，且有足够的剩余资源来应对业务负载的正常波动，无需干预。若指标值低于40，则表示资源利用率偏低，需要考虑资源的缩容回收。若指标值高于60，则表示承载业务系统的服务器负载过大，在负载波峰时有无法及时响应用户请求的风险，需要考虑扩容。",
  "tenant.assign": "指标定义：该指标反映租户申请的云资源（即各业务系统的资源配额）的实际使用率，也就是各个业务系统实际开通的裸金属服务器和虚拟机占所申请配额的比例。具体计算公式为：资源使用率评分=100*(SUM(各业务系统实际使用的裸金属台数)+SUM(各业务系统实际使用的裸金属台数))/(SUM(各业务系统的裸金属配额)+SUM(各业务系统的虚拟机配额))<br />运维建议：该指标值越高表示租户申请的资源配额已更大比例的用于实际承载业务系统的运行了。对于评分较低的租户应该了解资源使用偏低的原因，如果是需求评估不准确造成的过度冗余，可推动其提交资源回收，以提高资源的流动性。",
  "tenant.cpuScore": "指标定义：该指标反映租户使用的所有服务器（包括裸金属和虚拟机）的CPU资源利用情况，CPU利用率（%）在40-60之间为理想区间，评分为100；低于此范围的则认为资源利用率不足，越低评分越低；超过此范围则认为服务器过于繁忙，存在影响业务系统服务能力的风险，越高评分越低。具体计算公式为（设每台服务器的CPU利用率为R）：SUM(MIN(100,100R/24-R*R/24))/服务器台数",
  "tenant.memScore": "指标定义：该指标反映租户使用的所有服务器（包括裸金属和虚拟机）的内存资源利用情况，内存利用率（%）在50-70之间为理想区间，评分为100；低于此范围的则认为资源利用率不足，越低评分越低；超过此范围则认为服务器过于繁忙，存在影响业务系统服务能力的风险，越高评分越低。具体计算公式为（设每台服务器的内存利用率为R）：SUM(MIN(100,120R/35-R*R/35))/服务器台数",
  "tenant.unbalance": "指标定义：该指标反映租户使用的所有服务器（包括裸金属和虚拟机）的CPU和内存资源利用的不均衡程度，与业务系统的资源利用不平衡度指标类似，由每台服务器的CPU和内存利用率（%)的差值加权平均得到，值越高表示资源利用越不均衡。具体计算公式为：资源利用不平衡度=SUM(|各服务器CPU利用率-各服务器内存利用率|)*100/服务器台数",
  "rp.assign": "指标定义：该指标反映当前资源池的已分配给租户的资源占比，具体计算公式为：(已分配的裸金属台数+已分配的vCPU核数+已分配的内存大小)*100/(裸金属总数+宿主机CPU总核数+宿主机内存总大小)<br />运维建议：该指标值越高一般反映承载的业务系统越多，需要作为运维巡检的重点关注对象，保证其运行稳定性，并需根据发展趋势提前规划扩容；若指标值较低，则需分析具体原因，并结合新业务系统的部署规划计划确定是否需要将资源调配到其他资源池。",
  "rp.busy": "指标定义：该指标反映当前资源池所有服务器（包括裸金属和KVM宿主机）的资源利用情况，由每台服务器的CPU和内存利用率（%)加权平均得到，值越高表示资源利用率越高。具体计算公式为：繁忙度=(SUM(各服务器CPU利用率)/服务器台数+SUM(各服务器内存利用率)/服务器台数)*100/2<br />运维建议：该指标的值为40-60的理想区间时，表示该资源池的资源利用率较为充分，且有足够的剩余资源来应对业务负载的正常波动，无需干预。若指标值低于40，则表示资源利用率偏低，需要考虑合理调配各租户业务系统的配额。若指标值高于60，则表示资源池内服务器的负载过大，在负载波峰时有无法及时响应用户请求的风险，需要考虑扩容并增加租户业务系统的配额。",
  "i18n": {
    "device.busy": "繁忙度",
    "device.unbalance": "不平衡度",
    "device.health": "健康度",
    "device.ha": "可用度",
    "app.busy": "繁忙度",
    "app.health": "健康度",
    "app.unbalance": "不平衡度",
    "app.ha": "可用度",
    "app.assign": "使用率",
    "tenant.level": "租户等级",
    "tenant.score": "租户评分",
    "tenant.usageScore": "资源利用评分",
    "tenant.assign": "资源使用率评分",
    "tenant.cpuScore": "CPU利用评分",
    "tenant.memScore": "内存利用评分",
    "tenant.unbalance": "资源利用不平衡度评分",
    "tenant.busy": "繁忙度",
    "rp.assign": "资源分配率",
    "rp.busy": "繁忙度"
  }
}
