package model

var (
	DevTypeMap = map[string]string{
		"85a802f297a24b2e9c9ec58dd15846b7": "X86 服务器",
		"f5f6b15cc48a43a1b02467f0bfcfbeae": "云主机",
		//"00ea0895df164cd4a431817b572d9d16": "小型机",
		//"14a9081b92ab41639de39eccea40bc99": "分布式块存储",
		//"1fe568aa754144bf911d68c35f1ef0d3": "对象存储",
		//"202a7a0c394549bbb4340656c49be6a4": "刀箱服务器",
		//"25bbe44ec1ba468688b991aee954e1f4": "交换机",
		//"3078758e1c084b9091a7e847fe8f4d8b": "VPN 设备",
		//"33e4456b9c40475b92f506b0ae4fc348": "路由器",
		//"5d07f4fe51f34c8087fc669d648c215c": "SDN 控制器",
		//"5dbbc2ce6c5547f0aa72076cb68a1712": "WAF",
		//"6be5a44574c04e50b2d99f4518732f38": "入侵防御设备",
		//"8b6e19bb98e844ebaee0f39a442b0db2": "负载均衡",
		//"92282925bdb648aa85cf3fda1aeebb03": "入侵检测设备",
		//"960ac51ce4654fc5b100c6b069159f70": "防火墙",
		//"991df24fcd694d7782ffae83845426ce": "漏洞扫描设备",
		//"a05bae7c0d3e4b5cae6723d52a36ef9f": "文件存储",
		//"a80f3eac75ed429b821a71f228b66326": "抗 DDOS 设备",
		//"bf991b42aa2044ecb4a0353c314c3e9b": "IP-SAN",
		//"cfaf7a4470294853b5a573fbf54c7169": "FC-SAN",
		//"f1112919d01c4977be73860b15612d72": "分流器",
	}

	IdcTypeMap = map[string]string{
		"033807b197a84db2a60a52db059e0944":      "郑州资源池",
		"05815a91eb134ab595936366a4804270":      "鹿泉资源池",
		"4a27f798cc29418f96c4aab723e67e34":      "宁波资源池",
		"6cb8fe27ad24447fbf8eb80647674777":      "石家庄资源池",
		"6d40d7d3-90a7-11e9-bb30-0242ac110002":  "哈尔滨资源池",
		"6d40d847-90a7-11e9-bb30-0242ac110002":  "呼和浩特资源池",
		"6d40db4e-90a7-11e9-bb30-0242ac110002":  "信息港资源池",
		"6d40dba3-90a7-11e9-bb30-0242ac110002":  "北京池外",
		"6d40dbaf-90a7-11e9-bb30-0242ac110002":  "南基资源池",
		"6d40dbaf-90a7-11e9-bb30-0242ac1100044": "深圳池外",
		"91be615f061440f4808007c69045298d":      "株洲资源池",
		"9d39bbbdbe6e4293adcac19cc37703eb":      "杭州湾资源池",
		"c036d6c902e842e5893728d8a6ba1e3b":      "湘潭资源池",
		"c2a6c91ccdee428ab2e1a925ead19ea3":      "佛山资源池",
		"c52474b9a3f445819a6abca0c400944c":      "汕头资源池",
		"f887c61894b04e3badae21541bebc39a":      "苏州资源池",
		"fa7e4227dc9d4b81aed039440b3ea3c2":      "航空港资源池",
	}
)
